# AlphanumericRevisionSettings Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AlphanumericRevisionSettings Members
AlphanumericRevisionSettings Class Constructors Methods Properties See Also
---
The AlphanumericRevisionSettings type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AlphanumericRevisionSettings()()()() | Constructs an AlphanumericRevisionSettings with a simple, default sequence. |
| AlphanumericRevisionSettings(AlphanumericRevisionSettings) | Constructs a new copy of the input AlphanumericRevisionSettings object. |
| AlphanumericRevisionSettings(IList<(Of <<'(String>)>>), String, String) | Constructs an AlphanumericRevisionSettings object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the AlphanumericRevisionSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSequence | Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Determines whether a specified AlphanumericRevisionSettings is the same as 'this'. |
| IsValid | Determines whether the AlphanumericRevisionSettings object is in a valid state. |
| SetSequence | Sets the sequence of strings to be used as numbers for revisions with the Alphanumeric RevisionNumberType. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Prefix | The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType. |
| Suffix | The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType. |

# See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace